# Height Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
TextNode..::..Height Property
TextNode Class See Also
---
Height [ft] of the area of the text content in model space.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public double Height { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Height As Double
	Get
```

Visual C++
---
```text
public:
property double Height {
	double get ();
}
```

# See Also
TextNode Class
Autodesk.Revit.DB Namespace